#+STARTUP: overview
* COMMENT c Rainbow delimiters
#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook (prog-mode .rainbow-delimiters-mode))

#+end_src

#+RESULTS:
| rainbow-delimiters |

* Org mode Stuff
the org mode customizations
#+begin_src emacs-lisp
<<<<<<< HEAD
      (use-package org
        ;;:ensure t
        )
      (use-package org-bullets
        ;;:ensure t
        :config
        (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))
      (custom-set-variables
       '(org-directoy "~/orgFiles")
       '(org-default-notes-file (concat org-directory "/notes.org"))
=======
  ;(push 'org-habit org-modules)q
  (use-package org-bullets
        :ensure t
        :config
        (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))
  (custom-set-variables
       '(org-directoy "~/orgFiles")
       '(org-default-notes-file (concat org-directory "/notes.org/"))
>>>>>>> help
       '(org-startup-folted (quote overview))
       '(org-hide-leading-stars t)
       '(org-startup-indented t)
       )
<<<<<<< HEAD
      (global-set-key "\C-ca" 'org-agenda)
      (global-set-key "\C-Cc" 'org-capture)
      (defun set-bidi-env ()
      "interactive"
      (setq bidi-paragraph-direction 'nil))
    (add-hook 'org-mode-hook 'set-bidi-env)


=======
  (global-set-key "\C-ca" 'org-agenda)
  (global-set-key "\C-Cc" 'org-capture)
>>>>>>> help



#+end_src

#+RESULTS:
| efs/org-mode-visual-fill | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | set-bidi-env | (lambda nil (org-bullets-mode 1)) | (lambda nil (display-line-numbers-mode 0)) | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |

* c company ghci
#+begin_src emacs-lisp 

  (use-package company-ghci
    :config
    (push 'company-ghci company-backends)
    (add-hook 'haskell-interactive-mode-hook 'company-mode)
    )
  (add-hook 'haskell-mode-hook #'hindent-mode)
#+end_src

#+RESULTS:
| hindent-mode | eglot-ensure | haskell-indentation-mode | interactive-haskell-mode |

* COMMENT c Ibuffer
#+begin_src emacs-lisp
       (global-set-key (kbd "C-x C-b") 'ibuffer)
       (setq ibuffer-saved-filter-groups
             (quote (("default"
                      ("dired" (mode . dired-mode))
                      ("org" (name . "^.*org$"))
                      ("web" (or (mode . web-mode)
                                 (mode . js2-mode)
                                 (mode . css-mode)))
                      ("shell" (or (mode . eshell-mode)
                                   (mode . shell-mode)))
                      ("programming" (or
                                      (mode .haskell-mode)
                                      (mode .lisp-mode)))
                      ("emacs" (or (name . "^\\*scratch\\*$")
                                   (name . "^\\*Messages\\*$")))
                      ))))
       (add-hook 'ibuffer-mode-hook
                 (lambda ()
                   (ibuffer-auto-mode 1)
                   (ibuffer-switch-to-saved-filter-groups "default")))

#+end_src

#+RESULTS:
| lambda | nil | (ibuffer-auto-mode 1) | (ibuffer-switch-to-saved-filter-groups default) |

* COMMENT speed type
#+begin_src emacs-lisp
        (use-package speed-type
          :custom
          (speed-type-default-lang 'English))
    


#+end_src

#+RESULTS:
33

* Visual ycolumn mode
#+begin_src emacs-lisp
    (defun efs/org-mode-visual-fill ()
      (setq visual-fill-column-width 190
            visual-fill-column-center-text t)
      (visual-fill-column-mode 1))
    (use-package visual-fill-column
      :hook (org-mode . efs/org-mode-visual-fill)
      )
#+end_src 

#+RESULTS:
| efs/org-mode-visual-fill | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | set-bidi-env | (lambda nil (org-bullets-mode 1)) | (lambda nil (display-line-numbers-mode 0)) | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |

*  exwm
#+begin_src emacs-lisp
  (set-frame-parameter (selected-frame) 'alpha '(90 . 90))
  (add-to-list 'default-frame-alist '(alpha . (90 . 90)))
  (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
  (add-to-list 'default-frame-alist '(fullscreen . maximum))

  ;;  (setq exwm-workspace-show-all-buffers t)
  (setq exwm-layout-show-all-buffers t)
  (defun efs/exwm-update-class ()
    (exwm-workspace-rename-buffer exwm-class-name))

  (use-package exwm
    :config
    (setq exwm-workspace-number 5)
    )

  (require 'exwm)
  (require 'exwm-config)
  (exwm-config-default)
  ;;  (require 'exwm-systemtray)

  (require 'exwm-xim)
  (exwm-xim-enable)

  (push ?\C-\\ exwm-input-prefix-keys)

  (setq exwm-workspace-number 10)

  (start-process-shell-command "xrandr" nil
                               "xrandr --output VGA-1 --off --output HDMI-1 --mode 1920x1200 --pos 0x0 --rotate normal --output DP-1 --off")
  ;;  (exwm-systemtray-enable)
  (require 'exwm-randr)
  (exwm-randr-enable)

  (setq exwm-input-global-keys
        `(([?\s-r] . exwm-reset)
          ([?\s-h] . grow-window-vertically)
          ([?\s-l] . shrink-window-vertically)
          ([?\s-\t] . other-window )
          ([?\s-w] . exwm-workspace-switch)
          ([?\s-\s] . counsel-linux-app)
          ([?\s-p] . counsel-linux-app)
          ([?\s-`] . (lambda () (interactive)
                       (exwm-workspace-switch-create 0)))
          ,@(mapcar (lambda (i)
                      `(,(kbd (format "s-%d" i)) .
                        (lambda ()
                          (interactive)
                          (exwm-workspace-switch-create ,i))))
                    (number-sequence 0 9))
          ))

  (setq exwm-input-simulation-keys
        '(([?\C-b] . [left])
          ([?\C-f] . [right])
          ([?\C-p] . [up])
          ([?\C-n] . [down])
          ([?\C-a] . [home])
          ([?\C-e] . [end])
          ([?\M-v] . [prior])
          ([?\C-v] . [next])
          ([?\C-d] . [delete])
          ([?\C-k] . [S-end delete])))

  ;;k(exwm-enable)

  ;; (use-package desktop-environment
  ;;   :after exwm

  ;;   )


  ;;( setq display-time-format "%d/%m/%Y %T")
  ;;(display-time-mode 1)
  (use-package counsel
    :bind
    ("s-SPC" . counsel-linux-app)
    ("C-x C-f" . counsel-find-file)
    :custom
    (counsel-linux-app-format-function #'counsel-linux-app-format-function-name-only)
    )

  (defun efs/exwm-update-title ()
    (pcase exwm-class-name
      ("firefox" (exwm-workspace-rename-buffer (format "Firefox: %s" exwm-title)))
      ("qutebrowser" (exwm-workspace-rename-buffer (format "qute: %s" exwm-title)))
      ))

  (add-hook 'exwm-update-title-hook #'efs/exwm-update-title)

  ;;    (exwm-input-set-key (kbd "<s-return>")  'vterm)
  (exwm-input-set-key (kbd "<s-return>")  'multi-vterm)
  (exwm-input-set-key (kbd "C-S-j") 'window-swap-states)
  (exwm-workspace-switch-create 1)

  (server-start)

  (defun passmenu ()
    "passmenu"
    (interactive)
    (call-process-shell-command "/usr/bin/passmenu" nil 0))

  (exwm-input-set-key (kbd "M-P") 'passmenu)

  (defvar efs/panel-process nil
    "holds the process of the running panel if any")
  (defun efs/kill-panel ()
    (interactive)
    (when efs/panel-process
      (ignore-errors
        (kill-process efs/panel-process ))))

  (defun efs/start-panel ()
    (interactive)
    (efs/kill-panel)
    (setq efs/panel-process
          (start-process-shell-command
           "xmobar" nil "xmobar -d ~/.config/xmobar/xmobarrc.exwm.hs ")))

  (efs/start-panel)
  (start-process-shell-command "xmodmap" nil "xmodmap ~/.Xmodmap")
  ;;  (menu-bar-mode)

    #+END_Src

    #+RESULTS:
    : #<process xmodmap>


